---
type: StructuralSectionConcreteT
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 3
tags: [revit-api, class]
---

# StructuralSectionConcreteT

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteT` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionConcreteT | 2016 | `public StructuralSectionConcreteT ( double width , double height , double centroidHorizontal , double centroidVertical , double principalAxesAngle , double sectionArea , double perimeter , double nominalWeight , double m` |
| Property | CantileverHeight | 2016 | `public double CantileverHeight { get ; set ; }` |
| Property | CantileverLength | 2016 | `public double CantileverLength { get ; set ; }` |